const ramenNodes = [
  {
    "Id": "굴진짬뽕",
    "Label": "굴진짬뽕"
  },
  {
    "Id": "김치라면",
    "Label": "김치라면"
  },
  {
    "Id": "리얼체다치즈라면",
    "Label": "리얼체다치즈라면"
  },
  {
    "Id": "메밀 비빔면",
    "Label": "메밀 비빔면"
  },
  {
    "Id": "부대찌개라면",
    "Label": "부대찌개라면"
  },
  {
    "Id": "북엇국라면",
    "Label": "북엇국라면"
  },
  {
    "Id": "쇠고기미역국라면",
    "Label": "쇠고기미역국라면"
  },
  {
    "Id": "오동통면",
    "Label": "오동통면"
  },
  {
    "Id": "오뚜기카레면",
    "Label": "오뚜기카레면"
  },
  {
    "Id": "유부우동컵",
    "Label": "유부우동컵"
  },
  {
    "Id": "오뚜기육개장",
    "Label": "오뚜기육개장"
  },
  {
    "Id": "스낵면",
    "Label": "스낵면"
  },
  {
    "Id": "스파게티면",
    "Label": "스파게티면"
  },
  {
    "Id": "진라면 매운맛",
    "Label": "진라면 매운맛"
  },
  {
    "Id": "진라면 순한맛",
    "Label": "진라면 순한맛"
  },
  {
    "Id": "진짜장",
    "Label": "진짜장"
  },
  {
    "Id": "진쫄면",
    "Label": "진쫄면"
  },
  {
    "Id": "진짬뽕",
    "Label": "진짬뽕"
  },
  {
    "Id": "볶음진짬뽕",
    "Label": "볶음진짬뽕"
  },
  {
    "Id": "크림진짬뽕",
    "Label": "크림진짬뽕"
  },
  {
    "Id": "짜슐랭",
    "Label": "짜슐랭"
  },
  {
    "Id": "채황",
    "Label": "채황"
  },
  {
    "Id": "참깨라면",
    "Label": "참깨라면"
  },
  {
    "Id": "참깨라면 볶음면",
    "Label": "참깨라면 볶음면"
  },
  {
    "Id": "열려라 참깨라면",
    "Label": "열려라 참깨라면"
  },
  {
    "Id": "컵누들 매콤한맛",
    "Label": "컵누들 매콤한맛"
  },
  {
    "Id": "컵누들 잔치쌀국수맛",
    "Label": "컵누들 잔치쌀국수맛"
  },
  {
    "Id": "컵누들 매콤쌀국수맛",
    "Label": "컵누들 매콤쌀국수맛"
  },
  {
    "Id": "컵누들 마라맛",
    "Label": "컵누들 마라맛"
  },
  {
    "Id": "컵누들 로제맛",
    "Label": "컵누들 로제맛"
  },
  {
    "Id": "컵누들 마라샹궈맛",
    "Label": "컵누들 마라샹궈맛"
  },
  {
    "Id": "컵누들 우동맛",
    "Label": "컵누들 우동맛"
  },
  {
    "Id": "콕콕콕 스파게티",
    "Label": "콕콕콕 스파게티"
  },
  {
    "Id": "콕콕콕 라면볶이",
    "Label": "콕콕콕 라면볶이"
  },
  {
    "Id": "콕콕콕 치즈게티",
    "Label": "콕콕콕 치즈게티"
  },
  {
    "Id": "콕콕콕 치즈볶이",
    "Label": "콕콕콕 치즈볶이"
  },
  {
    "Id": "콕콕콕 마요짜장볶이",
    "Label": "콕콕콕 마요짜장볶이"
  },
  {
    "Id": "팥칼국수라면",
    "Label": "팥칼국수라면"
  },
  {
    "Id": "해물짬뽕라면",
    "Label": "해물짬뽕라면"
  },
  {
    "Id": "왕뚜껑",
    "Label": "왕뚜껑"
  },
  {
    "Id": "김치왕뚜껑",
    "Label": "김치왕뚜껑"
  },
  {
    "Id": "짬뽕왕뚜껑",
    "Label": "짬뽕왕뚜껑"
  },
  {
    "Id": "우동 왕뚜껑",
    "Label": "우동 왕뚜껑"
  },
  {
    "Id": "도시락",
    "Label": "도시락"
  },
  {
    "Id": "김치 도시락",
    "Label": "김치 도시락"
  },
  {
    "Id": "뽀로로 짜장",
    "Label": "뽀로로 짜장"
  },
  {
    "Id": "뽀로로 스파게티",
    "Label": "뽀로로 스파게티"
  },
  {
    "Id": "맵시면",
    "Label": "맵시면"
  },
  {
    "Id": "팔도 짜장면",
    "Label": "팔도 짜장면"
  },
  {
    "Id": "일품 해물라면",
    "Label": "일품 해물라면"
  },
  {
    "Id": "틈새라면 빨계떡",
    "Label": "틈새라면 빨계떡"
  },
  {
    "Id": "틈새라면 매운김치",
    "Label": "틈새라면 매운김치"
  },
  {
    "Id": "틈새라면 고기짬뽕",
    "Label": "틈새라면 고기짬뽕"
  },
  {
    "Id": "팔도 비빔면",
    "Label": "팔도 비빔면"
  },
  {
    "Id": "팔도비빔면",
    "Label": "팔도비빔면"
  },
  {
    "Id": "팔도비빔면 매운맛",
    "Label": "팔도비빔면 매운맛"
  },
  {
    "Id": "감자면",
    "Label": "감자면"
  },
  {
    "Id": "김치사발면",
    "Label": "김치사발면"
  },
  {
    "Id": "너구리",
    "Label": "너구리"
  },
  {
    "Id": "둥지비빔냉면",
    "Label": "둥지비빔냉면"
  },
  {
    "Id": "둥지물냉면",
    "Label": "둥지물냉면"
  },
  {
    "Id": "멸치칼국수",
    "Label": "멸치칼국수"
  },
  {
    "Id": "무파마",
    "Label": "무파마"
  },
  {
    "Id": "보글보글부대찌개면",
    "Label": "보글보글부대찌개면"
  },
  {
    "Id": "새우탕면",
    "Label": "새우탕면"
  },
  {
    "Id": "생생우동",
    "Label": "생생우동"
  },
  {
    "Id": "생생야끼우동 데리야끼",
    "Label": "생생야끼우동 데리야끼"
  },
  {
    "Id": "생생야끼우동 화끈한맛",
    "Label": "생생야끼우동 화끈한맛"
  },
  {
    "Id": "신라면",
    "Label": "신라면"
  },
  {
    "Id": "신라면 툼바",
    "Label": "신라면 툼바"
  },
  {
    "Id": "배홍동 비빔면",
    "Label": "배홍동 비빔면"
  },
  {
    "Id": "짜파게티",
    "Label": "짜파게티"
  },
  {
    "Id": "짜파게티 더 블랙",
    "Label": "짜파게티 더 블랙"
  },
  {
    "Id": "신라면 골드",
    "Label": "신라면 골드"
  },
  {
    "Id": "신라면 블랙",
    "Label": "신라면 블랙"
  },
  {
    "Id": "신라면 건면",
    "Label": "신라면 건면"
  },
  {
    "Id": "신라면 더 레드",
    "Label": "신라면 더 레드"
  },
  {
    "Id": "라면왕 김통깨",
    "Label": "라면왕 김통깨"
  },
  {
    "Id": "해물 안성탕면",
    "Label": "해물 안성탕면"
  },
  {
    "Id": "사천백짬뽕",
    "Label": "사천백짬뽕"
  },
  {
    "Id": "오징어짬뽕",
    "Label": "오징어짬뽕"
  },
  {
    "Id": "안성탕면",
    "Label": "안성탕면"
  },
  {
    "Id": "순하군 안성탕면",
    "Label": "순하군 안성탕면"
  },
  {
    "Id": "야채라면",
    "Label": "야채라면"
  },
  {
    "Id": "배홍동칼빔면",
    "Label": "배홍동칼빔면"
  },
  {
    "Id": "후루룩칼국수",
    "Label": "후루룩칼국수"
  },
  {
    "Id": "얼큰 장칼국수",
    "Label": "얼큰 장칼국수"
  },
  {
    "Id": "우육탕면",
    "Label": "우육탕면"
  },
  {
    "Id": "농심라면",
    "Label": "농심라면"
  },
  {
    "Id": "육개장사발면",
    "Label": "육개장사발면"
  },
  {
    "Id": "사천짜파게티",
    "Label": "사천짜파게티"
  },
  {
    "Id": "튀김우동",
    "Label": "튀김우동"
  },
  {
    "Id": "찰비빔면",
    "Label": "찰비빔면"
  },
  {
    "Id": "배홍동쫄쫄면",
    "Label": "배홍동쫄쫄면"
  },
  {
    "Id": "짜파게티범벅",
    "Label": "짜파게티범벅"
  },
  {
    "Id": "짜왕",
    "Label": "짜왕"
  },
  {
    "Id": "후루룩국수",
    "Label": "후루룩국수"
  },
  {
    "Id": "후루룩쌀국수 소고기장국",
    "Label": "후루룩쌀국수 소고기장국"
  },
  {
    "Id": "후루룩쌀국수 닭곰탕",
    "Label": "후루룩쌀국수 닭곰탕"
  },
  {
    "Id": "후루룩쌀국수 미역국",
    "Label": "후루룩쌀국수 미역국"
  },
  {
    "Id": "누들핏 마라탄탄",
    "Label": "누들핏 마라탄탄"
  },
  {
    "Id": "누들핏 튀김우동맛",
    "Label": "누들핏 튀김우동맛"
  },
  {
    "Id": "누들핏 짜파구리맛",
    "Label": "누들핏 짜파구리맛"
  },
  {
    "Id": "누들핏 새우탕맛",
    "Label": "누들핏 새우탕맛"
  },
  {
    "Id": "누들핏 육개장사발면맛",
    "Label": "누들핏 육개장사발면맛"
  },
  {
    "Id": "불닭볶음면",
    "Label": "불닭볶음면"
  },
  {
    "Id": "삼양라면",
    "Label": "삼양라면"
  },
  {
    "Id": "열라면",
    "Label": "열라면"
  },
  {
    "Id": "꼬꼬면",
    "Label": "꼬꼬면"
  },
  {
    "Id": "짜짜로니",
    "Label": "짜짜로니"
  },
  {
    "Id": "간짬뽕",
    "Label": "간짬뽕"
  },
  {
    "Id": "김치찌개면",
    "Label": "김치찌개면"
  },
  {
    "Id": "까르보 불닭볶음면",
    "Label": "까르보 불닭볶음면"
  },
  {
    "Id": "나가사끼 짬뽕",
    "Label": "나가사끼 짬뽕"
  },
  {
    "Id": "라이트 불닭",
    "Label": "라이트 불닭"
  },
  {
    "Id": "마라볶음면",
    "Label": "마라볶음면"
  },
  {
    "Id": "마라탕면",
    "Label": "마라탕면"
  },
  {
    "Id": "맛있는라면",
    "Label": "맛있는라면"
  },
  {
    "Id": "바지락술찜면",
    "Label": "바지락술찜면"
  },
  {
    "Id": "불닭볶음탕면",
    "Label": "불닭볶음탕면"
  },
  {
    "Id": "삼양라면 매운맛",
    "Label": "삼양라면 매운맛"
  },
  {
    "Id": "삼양 수타면",
    "Label": "삼양 수타면"
  },
  {
    "Id": "쇠고기면",
    "Label": "쇠고기면"
  },
  {
    "Id": "열무비빔면",
    "Label": "열무비빔면"
  },
  {
    "Id": "야끼소바 불닭볶음면",
    "Label": "야끼소바 불닭볶음면"
  },
  {
    "Id": "로제불닭납작당면",
    "Label": "로제불닭납작당면"
  },
  {
    "Id": "4가지 치즈 불닭볶음면",
    "Label": "4가지 치즈 불닭볶음면"
  },
  {
    "Id": "치즈 불닭볶음면",
    "Label": "치즈 불닭볶음면"
  },
  {
    "Id": "푸팟퐁커리 불닭볶음면",
    "Label": "푸팟퐁커리 불닭볶음면"
  },
  {
    "Id": "마라불닭납작당면",
    "Label": "마라불닭납작당면"
  },
  {
    "Id": "로제 불닭볶음면",
    "Label": "로제 불닭볶음면"
  },
  {
    "Id": "감자라면",
    "Label": "감자라면"
  },
  {
    "Id": "감자해물맛라면",
    "Label": "감자해물맛라면"
  },
  {
    "Id": "생면식감 직화짜장",
    "Label": "생면식감 직화짜장"
  },
  {
    "Id": "생면식감 순한맛",
    "Label": "생면식감 순한맛"
  },
  {
    "Id": "생면식감 꽃게탕면",
    "Label": "생면식감 꽃게탕면"
  },
  {
    "Id": "생면식감 매운맛",
    "Label": "생면식감 매운맛"
  },
  {
    "Id": "맵탱 청양고추대파라면",
    "Label": "맵탱 청양고추대파라면"
  },
  {
    "Id": "맵탱 후추소고기라면",
    "Label": "맵탱 후추소고기라면"
  },
  {
    "Id": "맵탱 마늘조개라면",
    "Label": "맵탱 마늘조개라면"
  },
  {
    "Id": "삼양 1963",
    "Label": "삼양 1963"
  },
  {
    "Id": "탱글 머쉬룸크림파스타",
    "Label": "탱글 머쉬룸크림파스타"
  },
  {
    "Id": "탱글 청크토마토파스타",
    "Label": "탱글 청크토마토파스타"
  },
  {
    "Id": "탱글 갈릭오일파스타",
    "Label": "탱글 갈릭오일파스타"
  },
  {
    "Id": "The미식 장인라면 담백한맛",
    "Label": "The미식 장인라면 담백한맛"
  },
  {
    "Id": "The미식 장인라면 얼큰한맛",
    "Label": "The미식 장인라면 얼큰한맛"
  },
  {
    "Id": "몰랑 클로렐라라면",
    "Label": "몰랑 클로렐라라면"
  },
  {
    "Id": "용가리 불볶음면 까르보나라",
    "Label": "용가리 불볶음면 까르보나라"
  },
  {
    "Id": "슛! 더비라면",
    "Label": "슛! 더비라면"
  },
  {
    "Id": "The미식 장인라면 오징어라면",
    "Label": "The미식 장인라면 오징어라면"
  },
  {
    "Id": "맥시칸 양념치킨 볶음면",
    "Label": "맥시칸 양념치킨 볶음면"
  },
  {
    "Id": "쌔리라! 빠지락라면",
    "Label": "쌔리라! 빠지락라면"
  },
  {
    "Id": "오모리김치찌개라면",
    "Label": "오모리김치찌개라면"
  },
  {
    "Id": "송탄식 부대짜글면",
    "Label": "송탄식 부대짜글면"
  },
  {
    "Id": "맛나면",
    "Label": "맛나면"
  },
  {
    "Id": "The미식 장인라면 맵싸한맛",
    "Label": "The미식 장인라면 맵싸한맛"
  },
  {
    "Id": "The미식 오징어초빔면",
    "Label": "The미식 오징어초빔면"
  },
  {
    "Id": "The미식 비빔면",
    "Label": "The미식 비빔면"
  },
  {
    "Id": "The미식 메밀비빔면",
    "Label": "The미식 메밀비빔면"
  },
  {
    "Id": "로스팅정면",
    "Label": "로스팅정면"
  },
  {
    "Id": "로스팅 짬뽕 홍게",
    "Label": "로스팅 짬뽕 홍게"
  },
  {
    "Id": "로스팅 서울라면",
    "Label": "로스팅 서울라면"
  },
  {
    "Id": "로스팅 짜장면 파기름",
    "Label": "로스팅 짜장면 파기름"
  },
  {
    "Id": "로스팅 서울짜장",
    "Label": "로스팅 서울짜장"
  },
  {
    "Id": "직화짜장",
    "Label": "직화짜장"
  },
  {
    "Id": "공화춘",
    "Label": "공화춘"
  }
];

const ramenEdges = [
  {
    "Source": "굴진짬뽕",
    "Target": "부대찌개라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건양배추;건청경채;건파;고춧가루;덱스트린;마늘;설탕;정제소금;정제수;진한감칠맛분말"
  },
  {
    "Source": "굴진짬뽕",
    "Target": "오뚜기카레면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;덱스트린;마늘;설탕;정제소금;정제수;진한감칠맛분말;향미증진제;후추분말"
  },
  {
    "Source": "굴진짬뽕",
    "Target": "스낵면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;고춧가루;마늘;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "굴진짬뽕",
    "Target": "진짬뽕",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "감칠맛베이스;건당근;건목이버섯;건양배추;건청경채;건파;고춧가루;덱스트린;마늘;볶음야채풍미유;설탕;오징어조미후레이크;정제수;진한감칠맛분말;짬뽕향미유;향미증진제"
  },
  {
    "Source": "굴진짬뽕",
    "Target": "크림진짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고춧가루;덱스트린;마늘;볶음야채풍미유;설탕;정제소금;정제수;진한감칠맛분말;짬뽕향미유;향미증진제"
  },
  {
    "Source": "굴진짬뽕",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건목이버섯;건양배추;고춧가루;설탕;정제소금;진한감칠맛분말;향미증진제;후추분말"
  },
  {
    "Source": "리얼체다치즈라면",
    "Target": "오뚜기카레면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "감칠맛베이스;강황;건당근;건브로콜리;건청경채;고추추출물;뉴크림전지분말;변성전분;복합양념분말;설탕;잔탄검;정제소금;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "부대찌개라면",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;건청경채;건파;고춧가루;설탕;쇠고기육수분말;정제소금;조미쇠고기맛후레이크;조미육수분말;칠리추출물;포도당"
  },
  {
    "Source": "부대찌개라면",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;건청경채;건파;설탕;쇠고기육수분말;유지혼합분말;정제소금;조미쇠고기맛후레이크;조미육수분말;포도당"
  },
  {
    "Source": "부대찌개라면",
    "Target": "진짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건양배추;건청경채;건파;고춧가루;덱스트린;마늘;설탕;정제수;조미육수분말;진한감칠맛분말;칠리추출물"
  },
  {
    "Source": "부대찌개라면",
    "Target": "볶음진짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건조김치;건청경채;건파;마늘;야채농축액;유지혼합분말;조미쇠고기맛후레이크;진한감칠맛분말;칠리추출물;포도당"
  },
  {
    "Source": "부대찌개라면",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;건파;고춧가루;덱스트린;설탕;쇠고기베이스분말;정제소금;조미육수분말;참맛육수분말;칠리추출물;포도당"
  },
  {
    "Source": "오동통면",
    "Target": "오뚜기카레면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;고추추출물;로스팅양파분말;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "유부우동컵",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건미역;건파;고춧가루;산도조절제;설탕;야채양념분말;정제소금;조미육수분말;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "오뚜기육개장",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건조맛살어묵;고춧가루;산도조절제;설탕;정제소금;조미육수분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "스낵면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;고춧가루;설탕;정제소금;조미육수분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "감칠맛베이스;건당근;건파;건표고버섯;고춧가루;산도조절제;설탕;정제소금;조미육수분말;칠리맛분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;건당근;건미역;건파;건표고버섯;사골양념분말;설탕;유지혼합분말;정제소금;조미육수분말;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "참깨라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건미역;건파;고추추출물;고춧가루;산도조절제;설탕;정제소금;조미육수분말;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건미역;건파;고춧가루;복합지미분;설탕;정제소금;조미육수분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "콕콕콕 라면볶이",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건조맛살어묵;건파;고추추출물;고춧가루;로스팅양파분말;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "감칠맛베이스;건당근;건미역;건표고버섯;고추추출물;고춧가루;로스팅양파분말;산도조절제;설탕;정제소금;조미육수분말;향미증진제;혼합농축분말;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "도시락",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;건표고버섯;고춧가루;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "김치 도시락",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;건표고버섯;고춧가루;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오동통면",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건파;고추추출물;고춧가루;복합지미분;산도조절제;설탕;정제소금;조미육수분말;칠리맛분말;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "유부우동컵",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건파;산도조절제;설탕;식물성유지;정제소금;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "스낵면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;마늘;설탕;식물성유지;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "스파게티면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "덱스트린;마늘;산도조절제;설탕;식물성유지;양파;올리고당;정제소금;정제수;토마토분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;복합양념분말;산도조절제;설탕;정제소금;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;복합양념분말;설탕;정제소금;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "진쫄면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건청경채;마늘;산도조절제;설탕;양파;올리고당;정제수;향미증진제"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "진짬뽕",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;닭육수농축액;덱스트린;마늘;사골엑기스;설탕;양파;정제수;진한감칠맛분말;향미증진제"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "크림진짬뽕",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;덱스트린;마늘;변성전분;사골엑기스;설탕;양파;정제소금;정제수;진한감칠맛분말;카레분말;향미증진제"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "컵누들 로제맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;로스팅양파분말;마늘;변성전분;설탕;올리고당;정제소금;카레향미분말;포도당;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "콕콕콕 스파게티",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건당근;덱스트린;마늘;산도조절제;설탕;식물성유지;양파;올리고당;정제소금;토마토분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "콕콕콕 라면볶이",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건파;고추추출물;로스팅양파분말;마늘;사골엑기스;산도조절제;설탕;양파;올리고당;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "콕콕콕 치즈게티",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건당근;덱스트린;마늘;산도조절제;설탕;식물성유지;양파;올리고당;정제소금;포도당;향미증진제"
  },
  {
    "Source": "오뚜기카레면",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건당근;고추추출물;로스팅양파분말;산도조절제;설탕;정제소금;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "오뚜기육개장",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고춧가루;산도조절제;설탕;정제소금;조미육수분말;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "스낵면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;설탕;식물성유지;정제소금;조미육수분말;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;산도조절제;설탕;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;설탕;영양강화제;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "참깨라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고춧가루;구운김;산도조절제;설탕;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고춧가루;구운김;설탕;식물성유지;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;반달어묵후레이크;설탕;영양강화제;정제소금;쪽파후레이크;포도당;향미증진제"
  },
  {
    "Source": "유부우동컵",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고춧가루;설탕;식물성유지;양조간장분말;우동베이스분말;정제소금;포도당;향미증진제"
  },
  {
    "Source": "유부우동컵",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건미역;고춧가루;산도조절제;설탕;정제소금;조미육수분말;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "유부우동컵",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;건파;고춧가루;산도조절제;설탕;영양강화제;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "감칠맛베이스;고추농축소스;고춧가루;구아검;매운볶음베이스;산도조절제;설탕;정제소금;조미쇠고기맛후레이크;조미육수분말;칠리추출물;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "참깨라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장베이스;감칠맛베이스;고춧가루;마늘양념분말;산도조절제;설탕;정제소금;조미육수분말;참맛육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장베이스;감칠맛베이스;고춧가루;마늘양념분말;설탕;정제소금;조미육수분말;참맛육수분말;칠리추출물;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "열려라 참깨라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장베이스;감칠맛베이스;마늘양념분말;산도조절제;설탕;정제소금;조미육수분말;칠리추출물;포도당;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장베이스;감칠맛베이스;고춧가루;산도조절제;설탕;정제소금;조미육수분말;진한감칠맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "오뚜기육개장",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장베이스;고춧가루;로스팅육수분말;산도조절제;설탕;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "스낵면",
    "Target": "진라면 매운맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장분말;감칠맛베이스;건당근;건청경채;건파;고춧가루;설탕;정제소금;조미육수분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "스낵면",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;감칠맛베이스;건당근;건청경채;건파;설탕;정제소금;조미육수분말;향미증진제;후추분말"
  },
  {
    "Source": "스낵면",
    "Target": "진짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건청경채;건파;고춧가루;마늘;설탕;조미육수분말;칠리추출물;향미증진제"
  },
  {
    "Source": "스낵면",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;설탕;식물성유지;정제소금;조미육수분말;칠리추출물;향미증진제;후추분말"
  },
  {
    "Source": "스파게티면",
    "Target": "컵누들 로제맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "닭육수분말;마늘;버터체다혼합분말;생크림분말;설탕;올리고당;정제소금;진한감칠맛분;포도당;후추분말"
  },
  {
    "Source": "스파게티면",
    "Target": "콕콕콕 스파게티",
    "Type": "Undirected",
    "Weight": "30",
    "shared_items": "건스위트콘;덱스트린;마늘;배농축조미액;버터체다혼합분말;산도조절제;생크림분말;설탕;스파게티소스분말;스파이스조미분말;식물성유지;아라비아따소스;양파;올리고당;올리브유;정제소금;진한감칠맛분;참맛순한향신분말;치즈분말;토마토분말;토마토소스;토마토페이스트;토마토향미유;파프리카추출색소;포도당;피망;향미증진제;허브앤치즈믹스;화이트식초;후추분말"
  },
  {
    "Source": "스파게티면",
    "Target": "콕콕콕 치즈게티",
    "Type": "Undirected",
    "Weight": "23",
    "shared_items": "건스위트콘;덱스트린;마늘;배농축조미액;버터체다혼합분말;산도조절제;설탕;식물성유지;아라비아따소스;양파;올리고당;올리브유;정제소금;참맛순한향신분말;토마토소스;토마토페이스트;토마토향미유;파프리카추출색소;포도당;피망;향미증진제;허브앤치즈믹스;화이트식초"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "진라면 순한맛",
    "Type": "Undirected",
    "Weight": "26",
    "shared_items": "간장분말;감칠맛베이스;건당근;건청경채;건파;건표고버섯;고추맛베이스;로스팅조미분말;마늘농축조미분;맛베이스;복합양념분말;볶음마늘분;설탕;쇠고기육수분말;숙성마늘맛분;육수맛조미분;정제소금;조미쇠고기맛후레이크;조미육수분말;진한감칠맛분;진한풍미맛분;참맛양지육수분말;칠리혼합추출물;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "볶음진짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건당근;건청경채;건파;건표고버섯;조미쇠고기맛후레이크;칠리맛분말;칠리추출물;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "채황",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;건고추입자;건청경채;건파;건표고버섯;마늘농축조미분;정제소금;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "참깨라면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;로스팅맛분말;로스팅조미분말;볶음마늘분;산도조절제;설탕;쇠고기육수분말;정제소금;조미육수분말;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;로스팅조미분말;볶음마늘분;설탕;정제소금;조미육수분말;칠리추출물;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "열려라 참깨라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;버섯야채조미분말;볶음마늘분;산도조절제;설탕;정제소금;조미육수분말;칠리추출물;포도당;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;볶음마늘분;설탕;쇠고기육수분말;정제소금;진한감칠맛분;포도당;향미증진제"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;맛베이스;설탕;쇠고기육수분말;정제소금;포도당;향미증진제"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;건당근;건표고버섯;고춧가루;산도조절제;설탕;정제소금;조미육수분말;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "왕뚜껑",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건당근;건파;건표고버섯;고춧가루;맛베이스;설탕;정제소금;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "도시락",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;건표고버섯;고춧가루;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "김치 도시락",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건파;건표고버섯;고춧가루;산도조절제;설탕;정제소금;향미증진제;후추분말"
  },
  {
    "Source": "진라면 매운맛",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "간장분말;건청경채;건파;고추맛베이스;고춧가루;버섯야채조미분말;볶음마늘분;볶음양념분말;산도조절제;설탕;정제소금;조미육수분말;칠리맛분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "채황",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;건청경채;건파;건표고버섯;마늘농축조미분;정제소금;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "참깨라면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고소한향미분말;로스팅조미분말;매운고추양념분말;볶음마늘분;설탕;쇠고기육수분말;옥수수전분;정제소금;조미육수분말;진한감칠맛분;참맛사골양념분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고소한향미분말;로스팅조미분말;매운고추양념분말;볶음마늘분;설탕;옥수수전분;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장분말;감칠맛베이스;건파;매운고추양념분말;볶음마늘분;설탕;쇠고기육수분말;영양강화제;정제소금;진한감칠맛분;포도당;향미증진제"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;맛베이스;설탕;쇠고기육수분말;정제소금;포도당;향미증진제;홍고추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건당근;건미역;건표고버섯;설탕;정제소금;조미육수분말;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "왕뚜껑",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛조미분;건당근;건파;건표고버섯;맛베이스;설탕;정제소금;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진라면 순한맛",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장분말;건청경채;건파;고추맛베이스;매운고추양념분말;볶음마늘분;설탕;영양강화제;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "진짜장",
    "Target": "짜슐랭",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건양배추;건양파;대두단백;설탕;시즈닝분말;식물성유지;양파볶음베이스;양파풍미유;영양강화제;정제소금;참맛간짜장분말;튀김감자다이스;향미증진제"
  },
  {
    "Source": "진짜장",
    "Target": "콕콕콕 마요짜장볶이",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건양배추;건양파;구수한짜장분말;대두단백;설탕;시즈닝분말;정제소금;짜장시즈닝분말;짜장조미분말;참맛간짜장분말;향미증진제"
  },
  {
    "Source": "진쫄면",
    "Target": "진짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;건당근;건양배추;건청경채;고춧가루;마늘;설탕;양파;정제수;칠리추출물;향미증진제"
  },
  {
    "Source": "진짬뽕",
    "Target": "볶음진짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건당근;건청경채;건파;고추기름;마늘;미더덕엑기스;진한감칠맛분말;짬뽕양념농축액;칠리추출물;해물찌개브로스;향미증진제"
  },
  {
    "Source": "진짬뽕",
    "Target": "크림진짬뽕",
    "Type": "Undirected",
    "Weight": "22",
    "shared_items": "감칠맛베이스;고춧가루;덱스트린;마늘;매운칠리추출물;미더덕엑기스;볶음야채풍미유;사골엑기스;설탕;양파;오징어양념분말;오징어엑기스;웍풍미소스;정제수;조미채종유;진한감칠맛분말;짬뽕양념농축액;짬뽕향미유;칠리추출물;해물야채볶음소스;향미증진제;혼합농축액"
  },
  {
    "Source": "진짬뽕",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건미역;건파;고춧가루;덱스트린;매운칠리추출물;설탕;조미육수분말;칠리추출물;향미증진제"
  },
  {
    "Source": "진짬뽕",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;건당근;건목이버섯;건미역;건양배추;고춧가루;설탕;조미육수분말;진한감칠맛분말;향미증진제"
  },
  {
    "Source": "크림진짬뽕",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고춧가루;덱스트린;매운칠리추출물;볶음마늘분;설탕;알파옥수수전분;정제소금;칠리추출물;향미증진제"
  },
  {
    "Source": "짜슐랭",
    "Target": "콕콕콕 마요짜장볶이",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장베이스;건양배추;건양파;대두단백;로스팅양파분말;설탕;시즈닝분말;정제소금;참맛간짜장분말;향미증진제"
  },
  {
    "Source": "참깨라면",
    "Target": "참깨라면 볶음면",
    "Type": "Undirected",
    "Weight": "27",
    "shared_items": "간장베이스;간장분말;감칠맛베이스;건미역;건파;계란;고소한맛풍미유;고소한향미분말;고춧가루;구운김;로스팅조미분말;마늘양념분말;매운고추양념분말;볶음마늘분;볶음참깨;볶음참깨분말;설탕;옥수수전분;정제소금;조미육수분말;참기름;참맛매운양념분말;참맛육수분말;파;포도당;향미증진제;후추분말"
  },
  {
    "Source": "참깨라면",
    "Target": "열려라 참깨라면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "간장베이스;감칠맛베이스;계란;고추기름;마늘양념분말;볶음마늘분;볶음참깨;산도조절제;설탕;옥수수전분;정제소금;조미육수분말;파;포도당;후추분말"
  },
  {
    "Source": "참깨라면",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "간장분말;감칠맛베이스;건파;고추기름;고추추출물;고춧가루;마늘양념분말;매운고추양념분말;매운고추추출물;볶음마늘분;설탕;쇠고기육수분말;정제소금;진한감칠맛분;포도당;향미증진제"
  },
  {
    "Source": "참깨라면",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고춧가루;설탕;쇠고기육수분말;정제소금;포도당;향미증진제"
  },
  {
    "Source": "참깨라면",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장베이스;감칠맛베이스;건미역;고추추출물;고춧가루;산도조절제;설탕;정제소금;조미육수분말;진한감칠맛분;포도당;향미증진제;후추분말"
  },
  {
    "Source": "참깨라면",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "간장베이스;간장분말;건파;계란;고소한참깨계란블럭;고추추출물;고춧가루;매운고추양념분말;매운고추추출물;볶음마늘분;산도조절제;설탕;정제소금;조미육수분말;파;포도당;향미증진제;후추분말"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "열려라 참깨라면",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "간장베이스;감칠맛베이스;계란;덱스트린;마늘양념분말;물엿;복합지미분;볶음마늘분;볶음참깨;설탕;옥수수전분;정제소금;조미육수분말;칠리추출물;파;포도당;후추분말"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장분말;감칠맛베이스;건파;고춧가루;덱스트린;마늘양념분말;매운고추양념분말;볶음마늘분;설탕;정제소금;포도당;향미증진제"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "컵누들 마라맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;감칠맛베이스;건파;고소한향미분말;덱스트린;설탕;식물성크림;정제소금;조미육수분말;효모조미분"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건미역;건파;고춧가루;덱스트린;설탕;식물성유지;정제소금;포도당;향미증진제"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "콕콕콕 치즈게티",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고춧가루;덱스트린;복합지미분;설탕;식물성유지;식물성크림;정제소금;포도당;향미증진제;혼합야채분"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장베이스;감칠맛베이스;건미역;고춧가루;설탕;정제소금;조미육수분말;포도당;향미증진제;효모조미분;후추분말"
  },
  {
    "Source": "참깨라면 볶음면",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "간장베이스;간장분말;건파;계란;고춧가루;매운고추양념분말;복합지미분;볶음마늘분;설탕;정제소금;조미육수분말;파;포도당;향미증진제;후추분말"
  },
  {
    "Source": "열려라 참깨라면",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장베이스;계란;버섯야채조미분말;복합지미분;볶음마늘분;산도조절제;설탕;영양강화제;정제소금;조미육수분말;파;포도당;후추분말"
  },
  {
    "Source": "컵누들 매콤한맛",
    "Target": "컵누들 매콤쌀국수맛",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건조김치분말;건조맛살어묵;건파;고추추출물;고춧가루;덱스트린;마늘양념분말;매운고추양념분말;설탕;정제소금;참맛다대기양념분말;청양초양념분말;포도당"
  },
  {
    "Source": "컵누들 매콤쌀국수맛",
    "Target": "컵누들 우동맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;감칠맛베이스;건조꽃맛살어묵;건파;고춧가루;덱스트린;설탕;쇠고기육수분말;정제소금;포도당;향미증진제"
  },
  {
    "Source": "컵누들 매콤쌀국수맛",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "간장분말;건파;고추추출물;고춧가루;매운고추양념분말;매운고추추출물;볶음마늘분;설탕;영양강화제;정제소금;청양고추추출물분말;포도당;향미증진제"
  },
  {
    "Source": "컵누들 로제맛",
    "Target": "컵누들 마라샹궈맛",
    "Type": "Undirected",
    "Weight": "20",
    "shared_items": "가공버터;건표고페이스트;고추장양념소스;고추추출물;뉴크림전지분;마늘;멸치육수분말;변성전분;생크림분말;설탕;올리고당;유당;유청분말;카레향미분말;파슬리후레이크;프로크림;햄맛베이스분말;향미증진제1;향미증진제2;후추분말"
  },
  {
    "Source": "컵누들 로제맛",
    "Target": "콕콕콕 라면볶이",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추장양념소스;고추추출물;로스팅양파분말;마늘;설탕;올리고당;정제소금;지미맛분말;진한감칠맛분;후추분말"
  },
  {
    "Source": "컵누들 로제맛",
    "Target": "콕콕콕 치즈볶이",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;뉴크림전지분;버터체다혼합분말;복합지미분;설탕;유청분말;정제소금;치즈향미분;파슬리후레이크;포도당"
  },
  {
    "Source": "콕콕콕 스파게티",
    "Target": "콕콕콕 치즈게티",
    "Type": "Undirected",
    "Weight": "26",
    "shared_items": "건당근;건스위트콘;건포도페이스트;덱스트린;마늘;배농축조미액;버터체다혼합분말;산도조절제;설탕;식물성유지;아라비아따소스;양파;올리고당;올리브유;정제소금;조미맛단백;참맛순한향신분말;토마토소스;토마토페이스트;토마토향미유;파프리카추출색소;포도당;피망;향미증진제;허브앤치즈믹스;화이트식초"
  },
  {
    "Source": "콕콕콕 라면볶이",
    "Target": "해물짬뽕라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건양배추;고추추출물;고춧가루;로스팅양파분말;산도조절제;설탕;야채볶음분말;정제소금;진한감칠맛분;향미증진제;후추분말"
  },
  {
    "Source": "콕콕콕 치즈게티",
    "Target": "콕콕콕 치즈볶이",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고춧가루;마스카포네치즈분말;버터체다혼합분말;복합지미분;설탕;정제소금;체다치즈분말;치즈향미분;포도당;향미증진제;혼합야채분"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "왕뚜껑",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "건당근;건표고버섯;고춧가루;돈골농축분말;마늘시즈닝분말;복합간장조미분말;생강풍미분말;설탕;쇠고기맛분;정제소금;조미분에이;파프리카추출색소;포도당;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "짬뽕왕뚜껑",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건당근;건미역;건양배추;비프시즈닝오일;산도조절제;생강풍미분말;설탕;정제소금;조미분에이;파프리카추출색소;향미증진제"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "도시락",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "감칠맛베이스;건당근;건표고버섯;고춧가루;복합간장조미분말;비프시즈닝오일;산도조절제;설탕;쇠고기장국분말;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "김치 도시락",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "감칠맛베이스;건당근;건표고버섯;고춧가루;복합간장조미분말;비프시즈닝오일;산도조절제;설탕;쇠고기장국분말;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "뽀로로 스파게티",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;건당근;건양배추;복합간장조미분말;비프시즈닝오일;산도조절제;설탕;정제소금;치킨스톡분말;파프리카추출색소;포도당;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "틈새라면 빨계떡",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건양배추;고춧가루;비프시즈닝오일;설탕;쇠고기맛분;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;포도당;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고춧가루;비프시즈닝오일;산도조절제;설탕;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "건목이버섯;건미역;건양배추;고춧가루;복합간장조미분말;복합감칠맛분말;산도조절제;생강풍미분말;설탕;정제소금;치킨스톡분말;파프리카추출색소;포도당;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "열라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장베이스;고추추출물;고춧가루;산도조절제;설탕;정제소금;조미육수분말;포도당;향미증진제;후추분말"
  },
  {
    "Source": "해물짬뽕라면",
    "Target": "몰랑 클로렐라라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건당근;건미역;건양배추;복합간장조미분말;산도조절제;생강풍미분말;설탕;포도당;향미증진제;후추분말"
  },
  {
    "Source": "왕뚜껑",
    "Target": "김치왕뚜껑",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장조미분말;건당근;건파;고추장양념분말;돈골농축분말;설탕;정제소금;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "왕뚜껑",
    "Target": "짬뽕왕뚜껑",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건당근;건파;볶음짬뽕분;새우분말;생강풍미분말;설탕;오징어조미분말;정제소금;조미분에이;파프리카추출색소;향미증진제"
  },
  {
    "Source": "왕뚜껑",
    "Target": "도시락",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "건당근;건파;건표고버섯;계란지단;고춧가루;고풍쇠고기맛분말;매운양념분말;복합간장조미분말;사골엑기스분말;설탕;소고기맛조미후레이크;정제소금;조미분에이;파프리카추출색소;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "왕뚜껑",
    "Target": "김치 도시락",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "건당근;건파;건표고버섯;계란지단;고춧가루;고풍쇠고기맛분말;매운양념분말;복합간장조미분말;사골엑기스분말;설탕;소고기맛조미후레이크;정제소금;조미분에이;파프리카추출색소;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "왕뚜껑",
    "Target": "일품 해물라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건당근;건파;고추장양념분말;고춧가루;설탕;양파분말;오징어조미분말;정제소금;파프리카추출색소;향미증진제;혼합조미료"
  },
  {
    "Source": "왕뚜껑",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건파;고춧가루;매운양념분말;설탕;정제소금;조미분에이;파프리카추출색소;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "왕뚜껑",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고춧가루;매운양념분말;복합간장조미분말;사골엑기스분말;생강풍미분말;설탕;오징어조미분말;정제소금;파프리카추출색소;포도당;향미증진제;혼합조미료;후추분말"
  },
  {
    "Source": "김치왕뚜껑",
    "Target": "짬뽕왕뚜껑",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "L-글루타민산나트륨;건당근;건파;산도조절제;설탕;정제소금;조미대두단백;조미마늘분-3;파프리카추출색소;향미증진제"
  },
  {
    "Source": "짬뽕왕뚜껑",
    "Target": "일품 해물라면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "L-글루타민산나트륨;건당근;건미역;건양배추;건오징어;건파;고추씨맛기름;매운조미고추맛분;산도조절제;새우모양후레이크;설탕;오징어조미분말;정제소금;파프리카추출색소;향미증진제"
  },
  {
    "Source": "짬뽕왕뚜껑",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건미역;건양배추;건청경채;산도조절제;생강풍미분말;설탕;오징어조미분말;정제소금;파프리카추출색소;향미증진제"
  },
  {
    "Source": "짬뽕왕뚜껑",
    "Target": "몰랑 클로렐라라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장분말;건당근;건미역;건양배추;건청경채;산도조절제;새우분말;생강풍미분말;설탕;오징어조미분말;향미증진제"
  },
  {
    "Source": "우동 왕뚜껑",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "L-글루탐산나트륨;건청경채;고춧가루;매운양념분말;산도조절제;설탕;양조간장분말;우마미베이스;정제소금;효모조미액분말"
  },
  {
    "Source": "우동 왕뚜껑",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "L-글루탐산나트륨;건미역;건청경채;고춧가루;덱스트린;매운양념분말;산도조절제;설탕;우마미베이스;정제소금;포도당"
  },
  {
    "Source": "우동 왕뚜껑",
    "Target": "몰랑 클로렐라라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "가쓰오부시분말;건당근;건미역;건청경채;다시마엑기스분말;대두유;덱스트린;산도조절제;설탕;포도당;효모조미액분말"
  },
  {
    "Source": "도시락",
    "Target": "김치 도시락",
    "Type": "Undirected",
    "Weight": "28",
    "shared_items": "감칠맛베이스;건당근;건조채심;건파;건표고버섯;계란지단;고춧가루;고풍쇠고기맛분말;매운양념분말;매운풍미분;복합간장조미분말;불고기맛분말;비프시즈닝오일;사골엑기스분말;산도조절제;설탕;소고기맛조미후레이크;쇠고기장국분말;양념소고기맛분말;육수풍미분말;정제소금;조미마늘분;조미분에이;파프리카추출색소;풍미유베이스분말;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "도시락",
    "Target": "틈새라면 빨계떡",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건파;고춧가루;매운풍미분;불고기맛분말;비프시즈닝오일;설탕;양념소고기맛분말;정제소금;조미마늘분;조미분에이;파프리카추출색소;후추분말"
  },
  {
    "Source": "도시락",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "건파;고춧가루;매운양념분말;매운풍미분;불고기맛분말;비프시즈닝오일;산도조절제;설탕;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "도시락",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고춧가루;매운양념분말;복합간장조미분말;사골엑기스분말;산도조절제;설탕;육수풍미분말;정제소금;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "김치 도시락",
    "Target": "틈새라면 빨계떡",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건파;고춧가루;매운풍미분;불고기맛분말;비프시즈닝오일;설탕;양념소고기맛분말;정제소금;조미마늘분;조미분에이;파프리카추출색소;후추분말"
  },
  {
    "Source": "김치 도시락",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "건파;고춧가루;매운양념분말;매운풍미분;불고기맛분말;비프시즈닝오일;산도조절제;설탕;양념소고기맛분말;정제소금;조미분에이;파프리카추출색소;핫베이스분말;향미증진제;후추분말"
  },
  {
    "Source": "김치 도시락",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고춧가루;매운양념분말;복합간장조미분말;사골엑기스분말;산도조절제;설탕;육수풍미분말;정제소금;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "뽀로로 스파게티",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건양배추;고지방분말;복합간장조미분말;산도조절제;설탕;정제소금;치킨스톡분말;파프리카추출색소;포도당;후추분말"
  },
  {
    "Source": "맵시면",
    "Target": "틈새라면 빨계떡",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건홍피망;매운맛베이스;설탕;이산화규소;정제소금;조미맛분;파프리카추출색소;포도당;효모조미액분말;후추분말"
  },
  {
    "Source": "맵시면",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "L-글루탐산나트륨;건미역;복합간장조미분말;생강풍미분말;설탕;이산화규소;정제소금;파프리카추출색소;포도당;후추분말"
  },
  {
    "Source": "팔도 짜장면",
    "Target": "공화춘",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감자;대두단백후레이크;덱스트린;돈지;돼지고기;변성전분;설탕;양파;전분;춘장"
  },
  {
    "Source": "일품 해물라면",
    "Target": "틈새라면 빨계떡",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "L-글루타민산나트륨;건양배추;건파;고춧가루;설탕;정제소금;조미마늘분;조미맛분;파프리카추출색소;표고버섯엑기스분말"
  },
  {
    "Source": "일품 해물라면",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건미역;건양배추;고춧가루;산도조절제;설탕;오징어조미분말;정제소금;파프리카추출색소;향미증진제;혼합조미료"
  },
  {
    "Source": "틈새라면 빨계떡",
    "Target": "틈새라면 매운김치",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "건파;고춧가루;매운맛베이스;매운풍미분;불고기맛분말;비프시즈닝오일;설탕;쇠고기조미분말;양념소고기맛분말;양조간장분말;장국베이스;정제소금;조미맛분;조미분에이;파프리카추출색소;핫스파이스분말;효모조미액분말;후추분말"
  },
  {
    "Source": "틈새라면 매운김치",
    "Target": "틈새라면 고기짬뽕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "L-글루탐산나트륨;건청경채;고춧가루;매운양념분말;산도조절제;설탕;우마미베이스;정제소금;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "틈새라면 고기짬뽕",
    "Target": "몰랑 클로렐라라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건미역;건양배추;건청경채;덱스트린;복합간장조미분말;산도조절제;생강풍미분말;설탕;오징어조미분말;지미베이스;포도당;향미증진제;후추분말"
  },
  {
    "Source": "팔도 비빔면",
    "Target": "팔도비빔면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "겨자분말;고추장;고춧가루;덱스트린;마늘엑기스;만두향미유;맛베이스;사과농축과즙;식초;양념간장액;양파농축액;정제소금;증점제;참기름;참깨;파프리카추출색소;향미증진제;홍고추엑기스"
  },
  {
    "Source": "팔도 비빔면",
    "Target": "팔도비빔면 매운맛",
    "Type": "Undirected",
    "Weight": "19",
    "shared_items": "겨자분말;고추장;고춧가루;덱스트린;마늘엑기스;만두향미유;맛베이스;사과농축과즙;산도조절제;식초;양념간장액;양파농축액;정제소금;증점제;참기름;참깨;파프리카추출색소;향미증진제;홍고추엑기스"
  },
  {
    "Source": "팔도비빔면",
    "Target": "팔도비빔면 매운맛",
    "Type": "Undirected",
    "Weight": "20",
    "shared_items": "겨자분말;고추장;고춧가루;덱스트린;마늘엑기스;만두향미유;맛베이스;사과농축과즙;설탕;식초;양념간장액;양파농축액;정제소금;증점제;참기름;참깨;파프리카추출색소;향미증진제;홍고추엑기스;효모추출물"
  },
  {
    "Source": "감자면",
    "Target": "신라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;설탕;정제소금;조미아미노산간장분말;호박산이나트륨"
  },
  {
    "Source": "감자면",
    "Target": "신라면 블랙",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;동결건조양파분말;마늘베이스;매운맛조미분;생강추출물분말;설탕;야채분말;정제소금;조미건조홍고추링;호박산이나트륨"
  },
  {
    "Source": "감자면",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;생강추출물분말;설탕;정제소금;조미아미노산간장분말;호박산이나트륨;후추풍미분말"
  },
  {
    "Source": "감자면",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;설탕;정제소금;조미아미노산간장분말;호박산이나트륨"
  },
  {
    "Source": "감자면",
    "Target": "야채라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;덱스트린;마늘베이스;매운맛조미분;생강추출물분말;정제소금;조미건조홍고추링"
  },
  {
    "Source": "너구리",
    "Target": "새우탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;건미역;설탕;정제소금;조미양념분;호박산이나트륨;혼합제제;홍합지미베이스분말;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "신라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;마늘베이스;볶음양념분;설탕;정제소금;조미아미노산간장분말;조미양념분;호박산이나트륨;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;마늘베이스;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;조미양념분;칠리맛풍미분;포도당;호박산이나트륨;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "라면왕 김통깨",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;조미양념분;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "해물 안성탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건미역;마늘베이스;복합조미간장분말;설탕;정제소금;호박산이나트륨;호화옥수수분;홍합지미베이스분말;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "오징어짬뽕",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;건미역;구운해물분;마늘베이스;복합조미간장분말;볶음양념분;설탕;정제소금;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;매운양념분말;복합조미간장분말;설탕;정제소금;칠리맛풍미분;포도당;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "너구리",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;마늘베이스;양파풍미분;정제소금;조미아미노산간장분말;조미양념분;칠리맛풍미분;포도당;호박산이나트륨;혼합제제"
  },
  {
    "Source": "너구리",
    "Target": "튀김우동",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건미역;멸치조미분;복합조미간장분말;양파풍미분;정제소금;포도당;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "둥지비빔냉면",
    "Target": "둥지물냉면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "겨자맛페이스트;구연산;기타과당;동치미농축액;배퓨레;사과식초;설탕;육수맛조미베이스;정제소금;조미건오이;조미아미노산간장;치킨육수추출물;화이트식초"
  },
  {
    "Source": "둥지비빔냉면",
    "Target": "배홍동 비빔면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고소한풍미유;고추장;구연산;기타과당;동치미농축액;마늘;배퓨레;변성전분;볶음참깨;설탕;양파;정제소금;참기름;채종유;화이트식초"
  },
  {
    "Source": "둥지비빔냉면",
    "Target": "찰비빔면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "겨자맛페이스트;고소한풍미유;고추장;구연산;기타과당;마늘;변성전분;설탕;정제소금;조미아미노산간장;참기름;채종유;화이트식초"
  },
  {
    "Source": "둥지비빔냉면",
    "Target": "배홍동쫄쫄면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "겨자맛페이스트;구연산;동결건조생생고추분말;동치미농축액;마늘;배퓨레;변성전분;사과식초;정제소금;조미아미노산간장;참기름;화이트식초"
  },
  {
    "Source": "멸치칼국수",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;건청경채;건파;마늘베이스;설탕;양파풍미분;정제소금;표고버섯분말;호박산이나트륨"
  },
  {
    "Source": "무파마",
    "Target": "신라면 골드",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;무착즙분말;설탕;양파풍미분;육수맛조미베이스;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "무파마",
    "Target": "신라면 블랙",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;생강추출물분말;설탕;양파풍미분;육수맛조미베이스;정제소금;조미건조홍고추링;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "무파마",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건파;생강추출물분말;설탕;양파풍미분;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "무파마",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건파;고춧가루;마늘동결건조분말;설탕;양파풍미분;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "무파마",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;무착즙분말;생강추출물분말;설탕;양파풍미분;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "보글보글부대찌개면",
    "Target": "신라면 골드",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;구연산;복합양념분말;볶음양념분;설탕;정제소금;조미아미노산간장분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "보글보글부대찌개면",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건파;볶음양념분;설탕;정제소금;조미아미노산간장분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "보글보글부대찌개면",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건파;볶음양념분;설탕;정제소금;조미아미노산간장분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "보글보글부대찌개면",
    "Target": "안성탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;복합양념분말;볶음양념분;비프본오일분말;사골추출물분말;설탕;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "보글보글부대찌개면",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;구연산;복합양념분말;볶음양념분;설탕;정제소금;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "새우탕면",
    "Target": "누들핏 새우탕맛",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건미역;매운맛분말;매운탕풍미분말;새우베이스분말;새우엑기스분말;설탕;어포;육수베이스분말;정제소금;칠리풍미분말;호박산이나트륨;혼합제제;혼합해물베이스분말"
  },
  {
    "Source": "생생야끼우동 데리야끼",
    "Target": "생생야끼우동 화끈한맛",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;가쓰오추출물;건양배추;건청경채;건홍피망;굴소스;덱스트린;미강유;설탕;육수맛조미베이스;정제소금;치킨추출농축액;호박산이나트륨;혼합옥수수분말;후추가루"
  },
  {
    "Source": "생생야끼우동 화끈한맛",
    "Target": "신라면 툼바",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;덱스트린;마늘;미강유;설탕;양파;정제소금;파프리카추출색소;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면",
    "Target": "신라면 골드",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;볶음양념분;설탕;정제소금;조미아미노산간장분말;조미홍고추분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면",
    "Target": "신라면 블랙",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;볶음양념분;설탕;정제소금;조미홍고추분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건당근;건청경채;건파;건표고버섯;마늘베이스;매운맛조미분;볶음양념분;설탕;소고기맛베이스;정제소금;조미소고기분말;조미아미노산간장분말;조미홍고추분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "19",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;간장양념분말;건청경채;건파;건표고버섯;마늘베이스;매운맛조미분;매콤양념분말;볶음양념분;설탕;소고기맛베이스;정제소금;조미소고기분말;조미아미노산간장분말;조미양념분;조미홍고추분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;마늘베이스;매운맛조미분;소고기맛베이스;정제소금;조미소고기분말;조미아미노산간장분말;조미양념분;호박산이나트륨"
  },
  {
    "Source": "신라면",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;볶음양념분;설탕;정제소금;조미홍고추분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 툼바",
    "Target": "배홍동 비빔면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;구연산;기타과당;냉동홍고추페이스트;마늘;변성전분;설탕;양파;정제소금;진육수추출액;채종유;파프리카추출색소;호박산이나트륨"
  },
  {
    "Source": "신라면 툼바",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;매운양념분말;변성전분;복합조미간장분말;설탕;정제말토스;정제소금;포도당;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 툼바",
    "Target": "찰비빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;구연산;기타과당;마늘;변성전분;복합조미간장분말;설탕;정제소금;채종유;파프리카추출색소"
  },
  {
    "Source": "배홍동 비빔면",
    "Target": "배홍동칼빔면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;고소한풍미유;구연산;냉동홍고추페이스트;다진양념베이스;동치미농축액;배퓨레;변성전분;볶음흑깨;정제소금;참기름;파프리카추출색소"
  },
  {
    "Source": "배홍동 비빔면",
    "Target": "찰비빔면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;고소한풍미유;고추장;구연산;구운김후레이크;기타과당;마늘;변성전분;설탕;정제소금;참기름;채종유;파프리카추출색소;혼합제제;화이트식초"
  },
  {
    "Source": "배홍동 비빔면",
    "Target": "배홍동쫄쫄면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;구연산;구운김후레이크;냉동홍고추페이스트;동치미농축액;마늘;배퓨레;변성전분;정제소금;참기름;파프리카추출색소;화이트식초"
  },
  {
    "Source": "짜파게티",
    "Target": "짜파게티 더 블랙",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건양배추;볶음양파분;볶음조미감자분;볶음조미소맥분;볶음조미옥수수분;분말짜장;설탕;정제소금;짜장베이스;혼합제제"
  },
  {
    "Source": "짜파게티",
    "Target": "사천짜파게티",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;건양배추;볶음양파분;볶음조미소맥분;볶음조미옥수수분;분말짜장;설탕;양파조미유;정제소금;조미대두단백;짜장풍미유;혼합제제"
  },
  {
    "Source": "짜파게티",
    "Target": "짜왕",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건양배추;설탕;야채오일분말;양파조미유;정제소금;조미대두단백;조미짜장분말;짜장베이스분말;짜장풍미유;튀김양파;혼합제제"
  },
  {
    "Source": "신라면 골드",
    "Target": "신라면 블랙",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;계란후레이크;매운맛조미분;볶음양념분;설탕;양파풍미분;육수맛조미베이스;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;볶음양념분;분말된장;설탕;양파풍미분;정제소금;조미아미노산간장분말;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;고추맛고명;마늘추출물분말;매운맛조미분;볶음양념분;설탕;식물성단백;양파풍미분;정제소금;조미아미노산간장분말;조미홍고추분말;청양고추분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "라면왕 김통깨",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;무착즙분말;볶음양념분;설탕;양파풍미분;어육발효풍미분;정제소금;조미아미노산간장분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;볶음감자분말;설탕;육수맛조미베이스;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "22",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;구연산;마늘추출물분말;매운맛조미분;무착즙분말;복합양념분말;볶음양념분;분말된장;설탕;식물성단백;양파풍미분;어육발효풍미분;정제소금;조미홍고추분말;청양고추분말;칠리맛풍미분;표고버섯분말;풋고추풍미료;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 골드",
    "Target": "육개장사발면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘추출물분말;매운맛조미분;복합양념분말;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "신라면 건면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;볶음양념분;생강추출물분말;설탕;양파풍미분;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;볶음양념분;설탕;양파풍미분;정제말토스;정제소금;조미홍고추분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "라면왕 김통깨",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;볶음양념분;생강추출물분말;설탕;양파풍미분;정제소금;칠리맛풍미분;콩나물추출물분말;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "야채라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건표고버섯;마늘베이스;매운맛조미분;생강추출물분말;양파풍미분;정제소금;조미건조홍고추링;표고버섯분말;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;설탕;야채분말;양지무베이스분말;육수맛조미베이스;정제말토스;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;볶음양념분;생강추출물분말;설탕;양파풍미분;정제말토스;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 블랙",
    "Target": "후루룩쌀국수 닭곰탕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;마늘베이스;사골분말;설탕;양파풍미분;육수맛조미베이스;정제소금;조미건조홍고추링;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "신라면 더 레드",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;건파;건표고버섯;마늘베이스;매운맛조미분;볶음양념분;설탕;소고기맛베이스;양파풍미분;정제소금;조미소고기분말;조미아미노산간장분말;조미홍고추분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "라면왕 김통깨",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;미강유;볶음양념분;생강추출물분말;설탕;양파풍미분;정제소금;조미아미노산간장분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "야채라면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건당근;건청경채;건표고버섯;마늘베이스;매운맛조미분;분말된장;생강추출물분말;양파풍미분;전분;정제소금;표고버섯분말;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;설탕;전분;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;마늘베이스;매운맛조미분;소고기맛베이스;양파풍미분;전분;정제소금;조미건조홍고추;조미소고기분말;조미아미노산간장분말;칠리맛풍미분;호박산이나트륨"
  },
  {
    "Source": "신라면 건면",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;볶음양념분;분말된장;생강추출물분말;설탕;양파풍미분;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 건면",
    "Target": "육개장사발면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건파;매운맛조미분;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "라면왕 김통깨",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;조미양념분;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;설탕;정제말토스;정제소금;조미홍고추분말;칠리맛풍미분;포도당;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;매운맛조미분;소고기맛베이스;양파풍미분;정제소금;조미소고기분말;조미아미노산간장분말;조미양념분;칠리맛풍미분;포도당;호박산이나트륨"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;마늘추출물분말;매운맛조미분;볶음양념분;설탕;식물성단백;양파풍미분;정제말토스;정제소금;조미홍고추분말;청양고추분말;칠리맛풍미분;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "육개장사발면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건파;마늘추출물분말;매운맛조미분;볶음양념분;설탕;양파풍미분;정제소금;조미아미노산간장분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "신라면 더 레드",
    "Target": "슛! 더비라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건청경채;건파;고춧가루;매운맛조미분;설탕;소고기맛베이스;정제소금;포도당;호박산이나트륨"
  },
  {
    "Source": "라면왕 김통깨",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;구운김후레이크;마늘베이스;맛베이스;볶음참깨;설탕;정제소금;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "라면왕 김통깨",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;맛베이스;비프조미분;양파풍미분;정제소금;조미아미노산간장분말;조미양념분;칠리맛풍미분;호박산이나트륨"
  },
  {
    "Source": "라면왕 김통깨",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;대파추출물분말;무착즙분말;볶음양념분;생강추출물분말;설탕;양파풍미분;어육발효풍미분;정제소금;칠리맛풍미분;표고버섯분말;호박산이나트륨;후추가루"
  },
  {
    "Source": "오징어짬뽕",
    "Target": "야채라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건당근;건양배추;덱스트린;마늘베이스;매운맛조미분;정제소금;칠리맛조미분;혼합제제;후추가루"
  },
  {
    "Source": "오징어짬뽕",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;동결건조오징어;마늘베이스;복합조미간장분말;설탕;정제말토스;정제소금;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "안성탕면",
    "Target": "순하군 안성탕면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장조미분말;건미역;고소한양념분말;덱스트린;볶음된장분말;비프본오일분말;설탕;양념장베이스;정제소금;조미된장분말;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "야채라면",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;간장분말;건청경채;매운맛조미분;분말된장;생강추출물분말;양파풍미분;정제소금;표고버섯분말;혼합제제;후추가루"
  },
  {
    "Source": "배홍동칼빔면",
    "Target": "배홍동쫄쫄면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "5'-리보뉴클레오티드이나트륨;구연산;냉동홍고추페이스트;돈골추출물;동치미농축액;물엿;배퓨레;변성전분;양지뜰태양초핫참고추장;정제소금;조미아미노산간장;참기름;파프리카추출색소"
  },
  {
    "Source": "후루룩칼국수",
    "Target": "얼큰 장칼국수",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;닭백숙분말;동결건조애호박;마늘베이스;볶음맛분말;설탕;육수맛조미베이스;정제소금;포도당;후추가루"
  },
  {
    "Source": "얼큰 장칼국수",
    "Target": "우육탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘베이스;맛베이스;야채분말;전분;정제소금;칠리맛풍미분;포도당;호박산이나트륨;혼합제제"
  },
  {
    "Source": "얼큰 장칼국수",
    "Target": "농심라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;설탕;정제말토스;정제소금;조미홍고추분말;칠리맛풍미분;표고버섯분말;호박산이나트륨;혼합제제;후추가루"
  },
  {
    "Source": "얼큰 장칼국수",
    "Target": "후루룩쌀국수 닭곰탕",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;닭백숙분말;마늘베이스;볶음감자분말;설탕;육수맛조미베이스;전분;정제소금;호박산이나트륨;후추가루"
  },
  {
    "Source": "농심라면",
    "Target": "육개장사발면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;마늘추출물분말;매운맛조미분;복합양념분말;볶음양념분;설탕;양파풍미분;정제소금;호박산이나트륨;후추가루"
  },
  {
    "Source": "육개장사발면",
    "Target": "누들핏 육개장사발면맛",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건파;계란스크램블;덱스트린;복합양념분말;복합조미간장분말;분말고추장;비프양념분말;소용돌이맛살;양념간장베이스;양념풍미분;육수조미분말;정제소금;조미아미노산간장분말;팜유조미분말"
  },
  {
    "Source": "사천짜파게티",
    "Target": "짜파게티범벅",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건감자튀김;건양배추;덱스트린;볶음양파분;볶음조미소맥분;분말짜장;설탕;조미볶음양파;혼합제제"
  },
  {
    "Source": "사천짜파게티",
    "Target": "짜왕",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건감자튀김;건양배추;동결건조완두콩;설탕;양파조미유;정제소금;조미대두단백;짜장풍미유;파풍미유;혼합제제"
  },
  {
    "Source": "튀김우동",
    "Target": "누들핏 튀김우동맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;건미역;고춧가루;다랑어추출물분말;맛포튀김;아미노산풍미분말;우동풍미분말;정제소금;호박산이나트륨;혼합제제"
  },
  {
    "Source": "찰비빔면",
    "Target": "배홍동쫄쫄면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "5'-리보뉴클레오티드이나트륨;겨자맛페이스트;구연산;구운김후레이크;마늘;변성전분;복합조미간장분말;정제소금;조미아미노산간장;참기름;파프리카추출색소;화이트식초"
  },
  {
    "Source": "누들핏 튀김우동맛",
    "Target": "누들핏 새우탕맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;건미역;네오화이버;덱스트린;설탕;정제소금;호박산이나트륨;혼합제제;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "까르보 불닭볶음면",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "고추추출물;고춧가루;고춧씨향미유;대두유;마늘;맛베이스에스;매운고추베이스분말;삼양간장분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "라이트 불닭",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고추추출물;대두유;마늘;맛베이스에스;매운고추베이스분말;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "불닭볶음면",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;맛베이스에스;삼양간장분;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;대두유;삼양간장분;양파;유산균발효분말;정백당;치킨카레맛베이스;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;대두유;마늘;매운고추베이스분말;삼양간장분;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "불닭볶음면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;맛베이스에스;매운고추베이스분말;삼양간장분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;맛베이스에스;매운고추베이스분말;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "불닭볶음면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;매운고추베이스분말;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "삼양라면",
    "Target": "맛있는라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건파;돈육풍미분말;마늘맛오일;맛베이스에스;매운조미고추맛분;베이컨향분말;볶음양념분말;정제소금;햄맛분말;향미증진제;혼합양념분말;후추분말"
  },
  {
    "Source": "삼양라면",
    "Target": "쇠고기면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건파;매운조미고추맛분;볶음양념분말;실당근;양념간장분;정제소금;청경채;팜유;향미증진제;혼합양념분말;효소추출물분말"
  },
  {
    "Source": "짜짜로니",
    "Target": "마라볶음면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "구연산;녹차풍미유;대두유;돈골농축액;변성전분;양파;양파엑기스;유산균발효분말;정백당;정제소금;토코페롤혼합분말;향미증진제"
  },
  {
    "Source": "간짬뽕",
    "Target": "까르보 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "대두유;마늘;마늘분말;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;후추분말"
  },
  {
    "Source": "간짬뽕",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "대두유;마늘;마늘분말;변성전분;양파;유산균발효분말;정백당;정제소금;조미맛분;파프리카추출물;후추분말"
  },
  {
    "Source": "김치찌개면",
    "Target": "쇠고기면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건파;발효간장베이스;비프풍미분;식물성크림분말;아미노산혼합제제;정백당;청경채;파프리카추출물;팜유;향미증진제;후추분"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "라이트 불닭",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;마늘;맛베이스에스;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "마라탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;후추분"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "바지락술찜면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;마늘;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;마늘분말;맛베이스에스;변성전분;삼양간장분;양파;유산균발효분말;정백당;정제소금;치킨향분말;파프리카추출물;후추분말"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;대두유;변성전분;삼양간장분;양파;유산균발효분말;정백당;치킨카레맛베이스;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "로제불닭납작당면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "고춧가루;대두유;마늘분말;매운고추베이스분말;모짜렐라치즈분말;버터시즈닝분말;변성전분;양파;정백당;지미강화육수분말;치킨향분말;크림맛분말;파슬리후레이크;하바네로맛시즈닝;혼합전지분유;후추분"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "고추추출물;대두유;마늘;매운고추베이스분말;모짜렐라치즈분말;변성전분;삼양간장분;양파;유산균발효분말;정백당;정제소금;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;맛베이스에스;매운고추베이스분말;모짜렐라치즈분말;변성전분;삼양간장분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "고추추출물;고춧가루;그릴치킨농축액;대두유;마늘;맛베이스에스;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파슬리후레이크;하바네로맛시즈닝;혼합전지분유;후추분말"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "마라불닭납작당면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;지미강화육수분말;치킨향분말;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "까르보 불닭볶음면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "20",
    "shared_items": "고추추출물;고춧가루;그릴치킨농축액;대두유;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;정제소금;지미강화육수분말;치킨카레맛베이스;치킨향분말;크림맛분말;파슬리후레이크;파프리카추출물;하바네로맛시즈닝;혼합전지분유;후추분"
  },
  {
    "Source": "라이트 불닭",
    "Target": "마라탕면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장;고추추출물;그릴치킨농축액;대두유;변성전분;양파;유산균발효분말;정백당;파프리카추출물;후추분"
  },
  {
    "Source": "라이트 불닭",
    "Target": "바지락술찜면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;마늘;변성전분;양파;유산균발효분말;정백당;파프리카추출물;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "라이트 불닭",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;대두유;마늘;맛베이스에스;변성전분;볶음참깨;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물"
  },
  {
    "Source": "라이트 불닭",
    "Target": "로제불닭납작당면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추씨향미유;대두유;매운고추베이스분말;변성전분;양파;정백당;지미강화육수분말;치킨향분말;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "라이트 불닭",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;대두유;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "라이트 불닭",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;대두유;마늘;맛베이스에스;매운고추베이스분말;변성전분;볶음참깨;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "라이트 불닭",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추씨향미유;고추추출물;그릴치킨농축액;대두유;마늘;맛베이스에스;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;하바네로맛시즈닝"
  },
  {
    "Source": "라이트 불닭",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "마라볶음면",
    "Target": "마라탕면",
    "Type": "Undirected",
    "Weight": "21",
    "shared_items": "간장;감칠맛베이스;고추추출물;대두유;돈골농축액;변성전분;산초오일;생강분;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;조미비프맛후레이크;청경채;코지원;투메릭분말;파프리카추출물;향미증진제;후추분;훠궈향신료베이스"
  },
  {
    "Source": "마라볶음면",
    "Target": "바지락술찜면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;파프리카추출물;향미증진제;후추분"
  },
  {
    "Source": "마라볶음면",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;증점제;파프리카추출물;향미증진제"
  },
  {
    "Source": "마라볶음면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;생강분;양파;유산균발효분말;정백당;파프리카추출물;향미증진제"
  },
  {
    "Source": "마라탕면",
    "Target": "바지락술찜면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "감칠맛베이스;고추추출물;그릴치킨농축액;대두유;변성전분;식물성크림분말;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;파프리카추출물;향미증진제;후추분"
  },
  {
    "Source": "마라탕면",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;파프리카추출물;향미증진제"
  },
  {
    "Source": "마라탕면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;생강분;양파;유산균발효분말;정백당;파프리카추출물;향미증진제"
  },
  {
    "Source": "마라탕면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;후추분"
  },
  {
    "Source": "맛있는라면",
    "Target": "삼양라면 매운맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건당근후레이크;건청경채후레이크;건파;고추씨향미유;고춧가루;매운고추베이스분말;양념갈비맛분말;정백당;정제소금;파프리카추출물;향미증진제;후추분말"
  },
  {
    "Source": "맛있는라면",
    "Target": "삼양 수타면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "건파;농후미;맛베이스에스;발효간장베이스;볶음양념분말;비프맛시즈닝오일;비프조미분말;양념갈비맛분말;육수맛분말;정백당;정제소금;지미강화베이스분말;파프리카추출물;향미증진제"
  },
  {
    "Source": "맛있는라면",
    "Target": "쇠고기면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건파;농후미;매운양념분말;매운조미고추맛분;발효간장베이스;볶음양념분말;비프맛시즈닝오일;정백당;정제소금;파프리카추출물;향미증진제;혼합양념분말"
  },
  {
    "Source": "맛있는라면",
    "Target": "맵탱 청양고추대파라면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건청경채후레이크;건파;매운고추베이스분말;매운양념분말;매운조미고추맛분;정백당;지미강화베이스분말;파프리카추출물;향미증진제;혼합양념분말;후추분말"
  },
  {
    "Source": "맛있는라면",
    "Target": "맵탱 후추소고기라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고춧가루;마늘맛오일;매운고추베이스분말;매운양념분말;발효간장베이스;정백당;파프리카추출물;향미증진제;혼합양념분말;후추분말"
  },
  {
    "Source": "바지락술찜면",
    "Target": "불닭볶음탕면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;고추추출물;대두유;마늘;변성전분;양파;유산균발효분말;정백당;정제소금;조미건조홍고추;파프리카추출물;향미증진제"
  },
  {
    "Source": "바지락술찜면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;양파;유산균발효분말;정백당;파프리카추출물;하바네로맛시즈닝;향미증진제"
  },
  {
    "Source": "바지락술찜면",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고추추출물;대두유;마늘;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "바지락술찜면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고추추출물;그릴치킨농축액;대두유;마늘;변성전분;삼양간장본;양파;유산균발효분말;정백당;하바네로맛시즈닝"
  },
  {
    "Source": "바지락술찜면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "고추추출물;그릴치킨농축액;대두유;마늘;변성전분;양파;유산균발효분말;정백당;정제소금;파프리카추출물;하바네로맛시즈닝;후추분"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "야끼소바 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;삼양간장분;양파;유산균발효분말;정백당;파프리카추출물;향미증진제;후추분말"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;고추추출물;대두유;마늘;변성전분;삼양간장분;양파;유산균발효분말;정백당;정제소금;치킨향분말;파프리카추출물"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;고춧가루;구운김후레이크;대두유;마늘;맛베이스에스;변성전분;볶음참깨;삼양간장분;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물;후추분말"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "감칠맛베이스;고추추출물;고춧가루;대두유;마늘;맛베이스에스;변성전분;양파;유산균발효분말;정백당;치킨향분말;후추분말"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;변성전분;양파;유산균발효분말;정백당;정제소금;치킨향분말;파프리카추출물"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "삼양 1963",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고춧가루;대두유;마늘분말;양파;유산균발효분말;정백당;지미강화베이스분말;치킨향분말;향미증진제;후추분말"
  },
  {
    "Source": "불닭볶음탕면",
    "Target": "탱글 갈릭오일파스타",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;고춧가루;대두유;마늘분말;변성전분;정백당;정제소금;지미강화베이스분말;치킨향분말;향미증진제;후추분말"
  },
  {
    "Source": "삼양 수타면",
    "Target": "쇠고기면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건파;농후미;마늘분말;발효간장베이스;볶음양념분말;비프맛시즈닝오일;실당근;정백당;정제소금;청경채;파프리카추출물;향미증진제;후추분"
  },
  {
    "Source": "야끼소바 불닭볶음면",
    "Target": "4가지 치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;삼양간장분;양파;유산균발효분말;정백당;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "야끼소바 불닭볶음면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;대두유;변성전분;삼양간장분;양파;유산균발효분말;정백당;치킨카레맛베이스;파프리카추출물;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "야끼소바 불닭볶음면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;대두유;변성전분;양파;유산균발효분말;정백당;치킨카레맛베이스;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "로제불닭납작당면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고춧가루;대두유;매운고추베이스분말;모짜렐라치즈분말;변성전분;양파;정백당;지미강화육수분말;치킨향분말;하바네로맛시즈닝"
  },
  {
    "Source": "로제불닭납작당면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고추씨향미유;고춧가루;대두유;매운고추베이스분말;변성전분;삼양간장본;양파;정백당;지미강화육수분말;치킨향분말;파슬리후레이크;하바네로맛시즈닝;혼합전지분유"
  },
  {
    "Source": "로제불닭납작당면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고춧가루;대두유;매운고추베이스분말;변성전분;양파;정백당;지미강화육수분말;치킨향분말;크림맛분말;파슬리후레이크;하바네로맛시즈닝;혼합전지분유;후추분"
  },
  {
    "Source": "4가지 치즈 불닭볶음면",
    "Target": "치즈 불닭볶음면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "고추추출물;대두유;마늘;매운고추베이스분말;매운치즈소스;모짜렐라치즈분말;변성전분;삼양간장분;양파;유산균발효분말;정백당;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "4가지 치즈 불닭볶음면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고추추출물;대두유;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;치킨향분말;하바네로맛시즈닝"
  },
  {
    "Source": "4가지 치즈 불닭볶음면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "고추추출물;대두유;마늘;매운고추베이스분말;매운치즈소스;변성전분;양파;유산균발효분말;정백당;정제소금;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "치즈 불닭볶음면",
    "Target": "푸팟퐁커리 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;맛베이스에스;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "치즈 불닭볶음면",
    "Target": "마라불닭납작당면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "고추추출물;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;지미강화육수분말;치킨향분말;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "치즈 불닭볶음면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "고추추출물;고춧가루;대두유;마늘;매운고추베이스분말;매운치즈소스;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파프리카추출물;하바네로맛시즈닝"
  },
  {
    "Source": "푸팟퐁커리 불닭볶음면",
    "Target": "마라불닭납작당면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "고추추출물;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;지미강화육수분말;치킨향분말;파프리카추출색소;하바네로맛시즈닝;후추분말"
  },
  {
    "Source": "푸팟퐁커리 불닭볶음면",
    "Target": "로제 불닭볶음면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "고추추출물;고춧가루;그릴치킨농축액;대두유;마늘;매운고추베이스분말;변성전분;양파;유산균발효분말;정백당;지미강화육수분말;치킨카레맛베이스;치킨향분말;파슬리후레이크;하바네로맛시즈닝;혼합전지분유"
  },
  {
    "Source": "푸팟퐁커리 불닭볶음면",
    "Target": "삼양 1963",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "감칠맛베이스;고춧가루;대두유;멸치엑기스분말;볶음양파분말;양파;유산균발효분말;정백당;치킨향분말;파프리카추출색소;후추분말"
  },
  {
    "Source": "생면식감 꽃게탕면",
    "Target": "로스팅 짬뽕 홍게",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건양배추;꽃게추출물;면류첨가알칼리제;밀글루텐;설탕;양조간장;유화유지;정제소금;치자황색소;해바라기혼합유;허브추출물"
  },
  {
    "Source": "맵탱 청양고추대파라면",
    "Target": "맵탱 마늘조개라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;매운양념분말;매운조미고추맛분;정백당;청양고추추출물분말;파프리카추출물;향미증진제;혼합양념분말;혼합제제;후추분말"
  },
  {
    "Source": "맵탱 후추소고기라면",
    "Target": "맵탱 마늘조개라면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "감칠맛베이스;고추추출물;마늘분말;매운양념분말;생강분말;정백당;파프리카추출물;향미증진제;혼합양념분말;후추분말"
  },
  {
    "Source": "삼양 1963",
    "Target": "탱글 청크토마토파스타",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "간장;대두유;로스팅마늘분말;볶음양파분말;양파;유산균발효분말;정백당;치킨향분말;파프리카추출색소;향미증진제;후추분말"
  },
  {
    "Source": "탱글 머쉬룸크림파스타",
    "Target": "탱글 청크토마토파스타",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장;그릴농축액;대두유;마늘;양파;유산균발효분말;정백당;치킨향분말;파슬리;향미증진제;효모추출물;후추분말"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "The미식 장인라면 얼큰한맛",
    "Type": "Undirected",
    "Weight": "21",
    "shared_items": "건당근;건파;기타식용유지가공품;다시마엑기스분말;대두단백후레이크;레시틴;메타인산나트륨;면류첨가알칼리제;변성전분;아미노조미액;야채조미추출물;정제소금;제일인산나트륨;증점제;치자황색소;치킨분말;치킨추출엑기스;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "The미식 장인라면 오징어라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "기타식용유지가공품;다시마엑기스분말;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치킨엑기스;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건당근;건파;기타식용유지가공품;다시마엑기스분말;메타인산나트륨;면류첨가알칼리제;정제소금;제일인산나트륨;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건당근;건파;기타식용유지가공품;다시마엑기스분말;면류첨가알칼리제;변성전분;아미노조미액;야채조미추출물;정제소금;치킨엑기스;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "The미식 비빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "기타식용유지가공품;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치자황색소;치킨엑기스;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 장인라면 담백한맛",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "기타식용유지가공품;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치킨엑기스;폴리인산나트륨;피로인산나트륨;효모추출물"
  },
  {
    "Source": "The미식 장인라면 얼큰한맛",
    "Target": "The미식 장인라면 오징어라면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건청경채;기타식용유지가공품;다시마엑기스분말;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 얼큰한맛",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건당근;건청경채;건파;기타식용유지가공품;다시마엑기스분말;메타인산나트륨;면류첨가알칼리제;정제소금;제일인산나트륨;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 얼큰한맛",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건당근;건청경채;건파;기타식용유지가공품;다시마엑기스분말;면류첨가알칼리제;변성전분;아미노조미액;야채조미추출물;정제소금;혼합제제;효모추출물"
  },
  {
    "Source": "용가리 불볶음면 까르보나라",
    "Target": "맥시칸 양념치킨 볶음면",
    "Type": "Undirected",
    "Weight": "17",
    "shared_items": "고과당;글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;무수구연산;변성전분;설탕;알칼리제;정제소금;치자황색소;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르;혼합제제;효모추출물"
  },
  {
    "Source": "용가리 불볶음면 까르보나라",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "기타식용유지가공품;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;팜유;혼합제제;효모추출물"
  },
  {
    "Source": "용가리 불볶음면 까르보나라",
    "Target": "The미식 오징어초빔면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "글리세린;기타식용유지가공품;대두유;덱스트린;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르"
  },
  {
    "Source": "용가리 불볶음면 까르보나라",
    "Target": "The미식 비빔면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;변성전분;정제소금;치자황색소;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르"
  },
  {
    "Source": "용가리 불볶음면 까르보나라",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;폴리글리세린지방산에스테르;효모추출물"
  },
  {
    "Source": "슛! 더비라면",
    "Target": "쌔리라! 빠지락라면",
    "Type": "Undirected",
    "Weight": "19",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;건파;글리신;면류첨가알칼리제;복합조미식품;설탕;소스;실당근;양송이엑기스분말;이산화규소;정제소금;제삼인산칼슘;토코페롤;포도당;호박산이나트륨;혼합제제;효모추출물;후추분말"
  },
  {
    "Source": "슛! 더비라면",
    "Target": "송탄식 부대짜글면",
    "Type": "Undirected",
    "Weight": "18",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;건파;고춧가루;글리신;대두단백후레이크;면류첨가알칼리제;복합조미식품;설탕;소고기맛베이스;소스;양송이엑기스분말;이산화규소;정제소금;파프리카추출색소;호박산이나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "슛! 더비라면",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "21",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;감칠맛인헨서;건청경채;건파;건표고;고추분말;매운맛조미분;면류첨가알칼리제;복합조미식품;소스;우지;이산화규소;정제소금;제삼인산칼슘;토코페롤;파프리카추출색소;포도당;호박산이나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 오징어라면",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "13",
    "shared_items": "건청경채;구연산;기타식용유지가공품;다시마엑기스분말;메타인산나트륨;면류첨가알칼리제;비타민B2;정제소금;제일인산나트륨;폴리인산나트륨;피로인산나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 오징어라면",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "건청경채;구연산;기타식용유지가공품;다시마엑기스분말;면류첨가알칼리제;변성전분;정제소금;치킨엑기스;팜유;혼합제제;효모추출물"
  },
  {
    "Source": "The미식 장인라면 오징어라면",
    "Target": "The미식 오징어초빔면",
    "Type": "Undirected",
    "Weight": "14",
    "shared_items": "건청경채;구연산;기타식용유지가공품;동결건조오징어;메타인산나트륨;면류첨가알칼리제;변성전분;실당근;정제소금;제일인산나트륨;치킨엑기스;팜유;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 장인라면 오징어라면",
    "Target": "The미식 비빔면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "구연산;기타식용유지가공품;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치킨엑기스;팜유;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 장인라면 오징어라면",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "기타식용유지가공품;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치킨엑기스;폴리인산나트륨;피로인산나트륨;효모추출물"
  },
  {
    "Source": "맥시칸 양념치킨 볶음면",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "기타식용유지가공품;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;팜유;혼합제제;효모추출물"
  },
  {
    "Source": "맥시칸 양념치킨 볶음면",
    "Target": "The미식 오징어초빔면",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "건양배추;글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르"
  },
  {
    "Source": "맥시칸 양념치킨 볶음면",
    "Target": "The미식 비빔면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;변성전분;정제소금;치자황색소;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르"
  },
  {
    "Source": "맥시칸 양념치킨 볶음면",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "11",
    "shared_items": "글리세린;기타식용유지가공품;대두유;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;폴리글리세린지방산에스테르;효모추출물"
  },
  {
    "Source": "쌔리라! 빠지락라면",
    "Target": "송탄식 부대짜글면",
    "Type": "Undirected",
    "Weight": "19",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;간장분말;건파;구연산;글리신;대파엑기스분말;마늘풍미분말;면류첨가알칼리제;복합조미식품;비타민B2;설탕;소스;양송이엑기스분말;이산화규소;정제소금;호박산이나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "쌔리라! 빠지락라면",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "19",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;간장분말;건고춧가루;건파;구연산;다시마엑기스분말;면류첨가알칼리제;복합조미식품;비타민B2;소스;이산화규소;정제소금;제삼인산칼슘;토코페롤;포도당;호박산이나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "쌔리라! 빠지락라면",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "간장분말;건파;구연산;다시마엑기스분말;면류첨가알칼리제;설탕;정제소금;토코페롤;혼합제제;효모추출물"
  },
  {
    "Source": "송탄식 부대짜글면",
    "Target": "맛나면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "5'-리보뉴클레오티드이나트륨;L-글루탐산나트륨;간장분말;건파;구연산;면류첨가알칼리제;복합조미식품;비타민B2;소스;이산화규소;정제소금;카라멜색소;파프리카추출색소;호박산이나트륨;혼합제제;효모추출물"
  },
  {
    "Source": "맛나면",
    "Target": "The미식 장인라면 맵싸한맛",
    "Type": "Undirected",
    "Weight": "12",
    "shared_items": "간장분말;건당근;건청경채;건파;구연산;기타식용유지가공품;다시마엑기스분말;면류첨가알칼리제;정제소금;토코페롤;혼합제제;효모추출물"
  },
  {
    "Source": "맛나면",
    "Target": "The미식 오징어초빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건청경채;구연산;기타식용유지가공품;메타인산나트륨;면류첨가알칼리제;정제소금;제일인산나트륨;토코페롤;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 장인라면 맵싸한맛",
    "Target": "The미식 오징어초빔면",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "건청경채;구연산;기타식용유지가공품;면류첨가알칼리제;변성전분;설탕;정제소금;치킨엑기스;토코페롤;팜유"
  },
  {
    "Source": "The미식 오징어초빔면",
    "Target": "The미식 비빔면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "구연산;글리세린;기타식용유지가공품;대두유;메타인산나트륨;면류첨가알칼리제;변성전분;정제소금;제일인산나트륨;치킨엑기스;토코페롤;팜유;폴리글리세린지방산에스테르;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 오징어초빔면",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "15",
    "shared_items": "글리세린;기타과당;기타식용유지가공품;대두유;메타인산나트륨;면류첨가알칼리제;변성전분;설탕;정제소금;제일인산나트륨;치킨엑기스;토코페롤;폴리글리세린지방산에스테르;폴리인산나트륨;피로인산나트륨"
  },
  {
    "Source": "The미식 비빔면",
    "Target": "The미식 메밀비빔면",
    "Type": "Undirected",
    "Weight": "16",
    "shared_items": "글리세린;기타식용유지가공품;대두유;매콤비빔장베이스;메타인산나트륨;면류첨가알칼리제;변성전분;비빔양념베이스;정제소금;제일인산나트륨;치킨엑기스;토코페롤;폴리글리세린지방산에스테르;폴리인산나트륨;피로인산나트륨;혼합양념분말"
  },
  {
    "Source": "로스팅 서울짜장",
    "Target": "직화짜장",
    "Type": "Undirected",
    "Weight": "10",
    "shared_items": "설탕;양파농축액;양파비프볶음분말;정제소금;증점제;짜장풍미분말;치자황색소;해바라기혼합유;허브추출물;후레바부스터분말"
  }
];
